
#ifndef INC_HTTPD_H_
#define INC_HTTPD_H_

/***	DEFINES	***************************************************************************************************************************************************************************************/
/*****************************************************************************************************************************************************************************************************/
//	Варианты документов  HTTP
#define EXISTING_HTML 0
#define E404_HTML 1
#define EXISTING_JPG 2
#define EXISTING_ICO 3

//	Статусы передачи данных
#define DATA_COMPLETED 0 //передача данных закончена
#define DATA_ONE 1 //передаём единственный пакет
#define DATA_FIRST 2 //передаём первый пакет
#define DATA_MIDDLE 3 //передаём средний пакет
#define DATA_LAST 4 //передаём последний пакет
#define DATA_END 5 //закрываем соединение после передачи данных

/***	FUNCTION PROTOTYPES 	*******************************************************************************************************************************************************************/
/*****************************************************************************************************************************************************************************************************/
void Http_Request(uint8_t sock_num);
void Http_Send_One(uint8_t sock_num);
void Http_Send_First(uint8_t sock_num);
void Http_Send_Middle(uint8_t sock_num);
void Http_Send_Last(uint8_t sock_num);
void SD_Error_Handler(uint8_t res);

#endif /* INC_HTTPD_H_ */
